contrast_media_list = ["йогексол",
                       "йодиксанол",
                       "йопромид",
                       "йоверсол",
                       "йобитридол",
                       "йомепрол",
                       "гадодиамид",
                       "гадотеровая кислота",
                       "гадобутрол",
                       "гадопентетовая кислота",
                       "гадобеновая кислота",
                       "гадотеридол"]

contrast_media_list_percent_format = [
    "9597363%3A%D0%99%D0%9E%D0%93%D0%95%D0%9A%D0%A1%D0%9E%D0%9BzZ219",  # 9597363:ЙОГЕКСОЛzZ219
    "9647323%3A%D0%99%D0%9E%D0%94%D0%98%D0%9A%D0%A1%D0%90%D0%9D%D0%9E%D0%9BzZ883",  # 9647323:ЙОДИКСАНОЛzZ883
    "9953788%3A%D0%99%D0%9E%D0%9F%D0%A0%D0%9E%D0%9C%D0%98%D0%94zZ2599",  # 9953788:ЙОПРОМИДzZ2599
    "9610215%3A%D0%99%D0%9E%D0%92%D0%95%D0%A0%D0%A1%D0%9E%D0%9BzZ426",  # 9610215:ЙОВЕРСОЛzZ426
    "9744373%3A%D0%99%D0%9E%D0%91%D0%98%D0%A2%D0%A0%D0%98%D0%94%D0%9E%D0%9BzZ1644",  # 9744373:ЙОБИТРИДОЛzZ1644
    "9600884%3A%D0%99%D0%9E%D0%9C%D0%95%D0%9F%D0%A0%D0%9E%D0%9BzZ317",  # 9600884:ЙОМЕПРОЛzZ317
    "9978222%3A%D0%93%D0%90%D0%94%D0%9E%D0%94%D0%98%D0%90%D0%9C%D0%98%D0%94zZ2676",  # 9978222:ГАДОДИАМИДzZ2676
    "9604215%3A%D0%93%D0%90%D0%94%D0%9E%D0%A2%D0%95%D0%A0%D0%9E%D0%92%D0%90%D0%AF+%D0%9A%D0%98%D0%A1%D0%9B%D0%9E%D0%A2%D0%90zZ345",
    # 9604215:ГАДОТЕРОВАЯ+КИСЛОТАzZ345
    "9628383%3A%D0%93%D0%90%D0%94%D0%9E%D0%91%D0%A3%D0%A2%D0%A0%D0%9E%D0%9BzZ641",  # 9628383:ГАДОБУТРОЛzZ641
    "9876441%3A%D0%93%D0%90%D0%94%D0%9E%D0%9F%D0%95%D0%9D%D0%A2%D0%95%D0%A2%D0%9E%D0%92%D0%90%D0%AF+%D0%9A%D0%98%D0%A1%D0%9B%D0%9E%D0%A2%D0%90zZ2309",
    # 9876441:ГАДОПЕНТЕТОВАЯ+КИСЛОТАzZ2309
    "9943991%3A%D0%93%D0%90%D0%94%D0%9E%D0%91%D0%95%D0%9D%D0%9E%D0%92%D0%90%D0%AF+%D0%9A%D0%98%D0%A1%D0%9B%D0%9E%D0%A2%D0%90zZ2559",
    # 9943991:ГАДОБЕНОВАЯ+КИСЛОТАzZ2559
    "9793979%3A%D0%93%D0%90%D0%94%D0%9E%D0%A2%D0%95%D0%A0%D0%98%D0%94%D0%9E%D0%9BzZ1957"
    # 9793979:ГАДОТЕРИДОЛzZ1957
]
