from ControllerDailyProcurements import ControllerDailyProcurements


class Controller:

    def __init__(self):
        contrast_media_list = ["йогексол",
                               "йодиксанол",
                               "йопромид",
                               "йоверсол",
                               "йобитридол",
                               "йомепрол",
                               "гадодиамид",
                               "гадотеровая кислота",
                               "гадобутрол",
                               "гадопентетовая кислота",
                               "гадобеновая кислота",
                               "гадотеридол"]
        contrast_media_list_filter = [
            "9597363%3A%D0%99%D0%9E%D0%93%D0%95%D0%9A%D0%A1%D0%9E%D0%9BzZ219",  # 9597363:ЙОГЕКСОЛzZ219
            "9647323%3A%D0%99%D0%9E%D0%94%D0%98%D0%9A%D0%A1%D0%90%D0%9D%D0%9E%D0%9BzZ883",  # 9647323:ЙОДИКСАНОЛzZ883
            "9953788%3A%D0%99%D0%9E%D0%9F%D0%A0%D0%9E%D0%9C%D0%98%D0%94zZ2599",  # 9953788:ЙОПРОМИДzZ2599
            "9610215%3A%D0%99%D0%9E%D0%92%D0%95%D0%A0%D0%A1%D0%9E%D0%9BzZ426",  # 9610215:ЙОВЕРСОЛzZ426
            "9744373%3A%D0%99%D0%9E%D0%91%D0%98%D0%A2%D0%A0%D0%98%D0%94%D0%9E%D0%9BzZ1644",  # 9744373:ЙОБИТРИДОЛzZ1644
            "9600884%3A%D0%99%D0%9E%D0%9C%D0%95%D0%9F%D0%A0%D0%9E%D0%9BzZ317",  # 9600884:ЙОМЕПРОЛzZ317
            "9978222%3A%D0%93%D0%90%D0%94%D0%9E%D0%94%D0%98%D0%90%D0%9C%D0%98%D0%94zZ2676",  # 9978222:ГАДОДИАМИДzZ2676
            "9604215%3A%D0%93%D0%90%D0%94%D0%9E%D0%A2%D0%95%D0%A0%D0%9E%D0%92%D0%90%D0%AF+%D0%9A%D0%98%D0%A1%D0%9B%D0%9E%D0%A2%D0%90zZ345",
            # 9604215:ГАДОТЕРОВАЯ+КИСЛОТАzZ345
            "9628383%3A%D0%93%D0%90%D0%94%D0%9E%D0%91%D0%A3%D0%A2%D0%A0%D0%9E%D0%9BzZ641",  # 9628383:ГАДОБУТРОЛzZ641
            "9876441%3A%D0%93%D0%90%D0%94%D0%9E%D0%9F%D0%95%D0%9D%D0%A2%D0%95%D0%A2%D0%9E%D0%92%D0%90%D0%AF+%D0%9A%D0%98%D0%A1%D0%9B%D0%9E%D0%A2%D0%90zZ2309",
            # 9876441:ГАДОПЕНТЕТОВАЯ+КИСЛОТАzZ2309
            "9943991%3A%D0%93%D0%90%D0%94%D0%9E%D0%91%D0%95%D0%9D%D0%9E%D0%92%D0%90%D0%AF+%D0%9A%D0%98%D0%A1%D0%9B%D0%9E%D0%A2%D0%90zZ2559",
            # 9943991:ГАДОБЕНОВАЯ+КИСЛОТАzZ2559
            "9793979%3A%D0%93%D0%90%D0%94%D0%9E%D0%A2%D0%95%D0%A0%D0%98%D0%94%D0%9E%D0%9BzZ1957"
            # 9793979:ГАДОТЕРИДОЛzZ1957
        ]
        federal_region_dict = {
            "Белгородская обл": "Центральный",
            "Брянская обл": "Центральный",
            "Владимирская обл": "Центральный",
            "Воронежская обл": "Центральный",
            "Ивановская обл": "Центральный",
            "Калужская обл": "Центральный",
            "Костромская обл": "Центральный",
            "Курская обл": "Центральный",
            "Липецкая обл": "Центральный",
            "Москва": "Центральный",
            "Московская обл": "Центральный",
            "Орловская обл": "Центральный",
            "Рязанская обл": "Центральный",
            "Смоленская обл": "Центральный",
            "Тамбовская обл": "Центральный",
            "Тверская обл": "Центральный",
            "Тульская обл": "Центральный",
            "Ярославская обл": "Центральный",
            "Архангельская обл": "Северо-Западный",
            "Вологодская обл": "Северо-Западный",
            "Калининградская обл": "Северо-Западный",
            "Карелия Респ": "Северо-Западный",
            "Коми Респ": "Северо-Западный",
            "Ленинградская обл": "Северо-Западный",
            "Мурманская обл": "Северо-Западный",
            "Ненецкий АО": "Северо-Западный",
            "Новгородская обл": "Северо-Западный",
            "Псковская обл": "Северо-Западный",
            "Санкт-Петербург": "Северо-Западный",
            "Адыгея Респ": "Южный",
            "Астраханская обл": "Южный",
            "Волгоградская обл": "Южный",
            "Калмыкия Респ": "Южный",
            "Краснодарский край": "Южный",
            "Ростовская обл": "Южный",
            "Крым Респ": "Южный",
            "Севастополь г": "Южный",
            "Дагестан Респ": "Северо-Кавказский",
            "Ингушетия Респ": "Северо-Кавазский",
            "Кабардино-Балкарская Респ": "Северо-Кавазский",
            "Карачаево-Черкесская Респ": "Северо-Кавазский",
            "Северная Осетия - Алания Респ": "Северо-Кавазский",
            "Ставропольский край": "Северо-Кавазский",
            "Чеченская Респ": "Северо-Кавазский",
            "Башкортостан Респ": "Приволжский",
            "Кировская обл": "Приволжский",
            "Марий Эл Респ": "Приволжский",
            "Мордовия Респ": "Приволжский",
            "Нижегородская обл": "Приволжский",
            "Оренбургская обл": "Приволжский",
            "Пензенская обл": "Приволжский",
            "Пермский край": "Приволжский",
            "Самарская обл": "Приволжский",
            "Саратовская обл": "Приволжский",
            "Татарстан Респ": "Приволжский",
            "Удмуртская Респ": "Приволжский",
            "Ульяновская обл": "Приволжский",
            "Чувашская Республика - Чувашия": "Приволжский",
            "Курганская обл": "Уральский",
            "Свердловская обл": "Уральский",
            "Тюменская обл": "Уральский",
            "Ханты-Мансийский Автономный округ - Югра АО": "Уральский",
            "Челябинская обл": "Уральский",
            "Ямало-Ненецкий АО": "Уральский",
            "Алтай Респ": "Сибирский",
            "Алтайский край": "Сибирский",
            "Иркутская обл": "Сибирский",
            "Кемеровская область - Кузбасс обл": "Сибирский",
            "Красноярский край": "Сибирский",
            "Новосибирская обл": "Сибирский",
            "Омская обл": "Сибирский",
            "Томская обл": "Сибирский",
            "Тыва Респ": "Сибирский",
            "Хакасия Респ": "Сибирский",
            "Амурская обл": "Дальневосточный",
            "Бурятия Респ": "Дальневосточный",
            "Еврейская Аобл": "Дальневосточный",
            "Забайкальский край": "Дальневосточный",
            "Камчатский край": "Дальневосточный",
            "Магаданская обл": "Дальневосточный",
            "Приморский край": "Дальневосточный",
            "Саха /Якутия/ Респ": "Дальневосточный",
            "Сахалинская обл": "Дальневосточный",
            "Хабаровский край": "Дальневосточный",
            "Чукотский АО": "Дальневосточный",
            "Байконур г": "Казахстан",
        }
        self.controller_daily_procurements = ControllerDailyProcurements(contrast_media_list_filter, federal_region_dict)
